export default {
  defaultLayoutSettings: 'Настройки установлены в значения по умолчанию',
  onlyOneSubmenu: 'Меню может содержать только одно открытое подменю',
  fileIsUploaded: 'Файл загружен, можно импортировать',
  confirmDeleteFile: 'Вы действительно хотите удалить этот файл?',

  pageLeaveConfirm: 'Вы действительно хотите покинуть страницу? Введённые вами данные не сохранятся',
  warehouseEditConfirm: ['Вы действительно хотите изменить склад? Все выбранные подсклады будут сброшены', 'Вы действительно хотите изменить склад? Все выбранные ТМЦ будут сброшены'],
  importMethodChangeConfirm: 'Вы действительно хотите изменить способ импорта? Выбранные ТМЦ для оприходования не сохранятся',
  confirmCloseDocument: 'Завершить документ?',
  confirmRecieveDocument: 'Оприходовать документ?',

  currentSessionWasChanged: 'Сессия изменена на соседней вкладке. {reload} страницу чтобы синхронизировать',

  confirmRemoveProduct: 'Вы действительно хотите удалить этот ТМЦ?',
  confirmRemoveProducts: 'Вы действительно хотите удалить выбранные ТМЦ?',

  productListAutoSaving: 'Изменения в списке ТМЦ сохраняются автоматически',
  fileListAutoSaving: 'Добавленные файлы сохраняются автоматически',
  molCanDiffer: 'Ответственный сотрудник может отличаться от {content} и должен быть прикреплен к указанному складу',
  molMustBeAttachedToWarehouse: '{content} должен быть прикреплен к складу',

  typeInDocumentInfo: 'Заполните информацию о документе',
  specifyDocumentTitle: 'Наименование документа укажите для удобной работы в {content}',
  specifyDocumentTitleAndDescription: 'Наименование документа и Описание документа укажите для удобной работы в {content}',
  specifyResponsibleEmployee: 'Укажите ответственного сотрудника, который будет проводить маркировку',
  selectAndTransferProduct: 'Выберите ТМЦ в колонке слева и переместите в правую колонку.',
  clickInfoBtnToEditDocument: 'Чтобы изменить информацию о документе, кликните на "Информация о документе" в левом верхнем углу',
  uploadFileWithProductList: 'Загрузите файл со списком товаров ТМЦ',
  selectProductsProductList: 'Выберите товары из справочника ТМЦ и укажите их количество',
  selectFileWithFormat: 'Выберите файл в формате',
  dragOrSelectFile: 'Перетащите файл в эту область или кликните сюда чтобы выбрать файл.',
  selectWarehousePlace: 'Выберите подсклад. Этот подсклад будет применён ко всем выбранным элементам',
  selectFieldWarehousePlace: 'Выберите поле "Подсклад", если хотите провести инвентаризацию по конкретной зоне',
};
